import {kataganaWord, KataganaWord, word, Word} from "@site/src/components/WordsDisplay/WordsDisplay";

export default {
    words: [
        word("管理人", "かんりにん", "n.管理员"),
        word("粗大ごみ", "そだいごみ", "n.大件垃圾"),
        word("回収", "かいしゅう", "v.回收"),
        word("伝票","でんぴょう","n.发票"),
        word("梱包する","こんぽうする","v.包装"),
        word("貼る","はる","v.张贴,贴"),
        word("請求書","せいきゅうしょ","n.申请书"),
        word("営業担当","えいぎょうたんとう","n.业务负责人"),
        word("外出","がいしゅつ","n/v.外出"),
        word("主に","おもに","adv.主要的"),
        word("ずつ","ずつ","adv.每个"),
        word("発展","はってん","v.发展"),
        word("経済学","けいざいがく","n.经济学"),
        word("学期末","がっきまつ","n.学期末"),
        word("会費制","かいひせい","n.会费制"),
        word("係","がかり","n.负责人"),
        word("生かす","いかす","v.使...继续生存,在...发挥作用,利用"),
        word("家庭","かてい","n.家庭"),
        word("交渉","こうしょう","v.交涉"),
        word("科学的","かがくてき","adj.科学的"),
        word("高齢者","こうれいしゃ","n.老年人"),
        word("介護","かいご","v.照顾"),
        word("敢えて","あえて","adv.敢于"),
        word("悪化","あっか","v.恶化"),
        word("区切る","くぎる","v.划分"),
        word("練る","ねる","v.研究,推敲"),
        word("輸入","ゆにゅう","v.进口"),
        word("見直す","みなおす","v.重新考虑,重新审视"),
        word("反して","はんして","adv.与...相反"),
        word("生き生きして","いきいきして","adv.生动,兴奋"),
        word("充実","じゅうじつ","v.精力旺盛"),
        word("茶碗","ちゃわん","n.茶碗"),
        word("茶道","さどう","n.茶道"),
        word("別件","べっけん","n.其他事项"),
        word("お米","おこめ","n.大米"),
        word("おにぎり","おにぎり","n.饭团"),
        word("給水","きゅうすい","v.供水"),
        
        
        
        
    ] as Word[],
    kataganaWords: [
        kataganaWord("メーカー","maker","n.制造商"),
        kataganaWord("コロッケ","croquette","n.炸丸子","法语"),
        kataganaWord("ボリューム","volume","n.容量"),
    ] as KataganaWord[],
}